// // - Користувач вводить або має два числа.
// //     Потрібно знайти та вивести максимальне число з тих двох .
// //     Також потрібно врахувати коли введені рівні числа.
//
//
// let numberOne = prompt('Write first number');
// let numberTwo = prompt('Write second number');
//
//
// if (numberOne > numberTwo) {
//     console.log(numberOne);
// } else if (numberOne < numberTwo) {
//     console.log(numberTwo);
// } else {
//     console.log('Числа рівні');
// }

// // У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// // Користувач вводить номер квартири просто в змінні або через prompt('') .
// // Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
//
//
// let numberOfFlat = prompt('Введіть номер квартири');
//
// if(numberOfFlat>=1&&numberOfFlat<=20){
//     console.log('Квартира знаходиться в першому під`їзді');
// }else if(numberOfFlat>=21&&numberOfFlat<=48){
//     console.log('Квартира знаходиться в другому під`їзді');
// }else if(numberOfFlat>=49&&numberOfFlat<=90) {
//     console.log('Квартира знаходиться в третьому під`їзді');
// }else {
//     console.log('Квартира відсутня в даному будинку')
// }

// // - Ми маємо змінну number в яку користувач задає числове значення,
// // якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
//
// let number = prompt('Введіть число');
//
// if (number === '10') {
//     console.log('ВІРНО');
//
// } else {
//     console.log('НЕВІРНО')
// }

// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else
