// // - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// // (в першу, другу, третю или четверту частину години).
//
// let time = prompt('Введіть число від 0 до 59');
//
// if (time >= 0 && time <= 15) {
//     alert('Число попада в першу чверть');
//
// } else if (time > 15 && time <= 30) {
//     alert('Число попада в другу чверть');
//
// } else if (time > 30 && time <= 45) {
//     alert('Число попада в третю чверть');
//
// } else if (time > 45 && time <= 59) {
//     alert('Число попада в четверту чверть');
// } else {
//     alert('Такої години не існує');
// }

// // - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
//
//
// let day = prompt('Введіть номер дня від 1 до 31');
//
// if (day >= 1 && day <= 10) {
//     alert('День знаходиться в першій декаді місяця');
//
// } else if (day > 10 && day <= 20) {
//     alert('День знаходиться в другій декаді місяця');
//
// } else if (day > 20 && day <= 31) {
//     alert('День знаходиться в третій декаді місяця');
//
// } else {
//     alert('Такого дня не існує')
// }
//

// // - У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
// //     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
// let test = prompt();
// test ? (console.log("вірно")) : (console.log('Неправильно'))
//
// if (test) {
//     console.log('вірно');
// } else {
//     console.log('неправильно')
// }

// // Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
//
// let number = prompt('Введіть число');
//
// if (number === '0') {
//     alert('вірно');
// } else {
//     alert('невірно');
// }

// // - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.
//
// let schoolDay = prompt('Введіть порядковий номер дня тижня');
//
// switch (schoolDay) {
//     case '1':
//         console.log('Математика\nМатематика\nФізика\nХімія\nТрудове');
//         break
//     case '2':
//         console.log('Фізькультура\nУкраїнська\nІноземнв\nХімія\nМатематика');
//         break
//     case '3':
//         console.log('Українська\nМатематика\nФізика\nМатематика\nЗарубіжна');
//         break
//     case '4':
//         console.log('Іноземна\nМатематика\nМатематика\nЛітература\nГеографія');
//         break
//     case '5':
//         console.log('Фізькультура\nМатематика\nМатематика\nІноземна\nФізика');
//         break
//     case '6':
//     case '7':
//         console.log('Вихідний');
//         break
//     default:
//         console.log('Упс');
// }

// // - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.
//
// let year = prompt('Введіть номер року');
// if(year<=0){
//     console.log('Упс')
// }
//
// else if ((year % 4) === 0) {
//     console.log('високосний')
//
// } else {
//     console.log('не високосний')
// }

// // - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// // Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!
//
//
// let nameOfJavaScript = prompt('Введіть назву JS');
//
// if (nameOfJavaScript === 'ECMAScript') {
//     console.log('Правильно!');
// } else {
//     console.log('Не знаєте? ECMAScript!');
// }