// // - Користувач вводить або має два числа.
// //     Потрібно знайти та вивести максимальне число з тих двох .
// //     Також потрібно врахувати коли введені рівні числа.
//
//
// let numberOne = prompt('Write first number');
// let numberTwo = prompt('Write second number');
//
//
// if (numberOne > numberTwo) {
//     console.log(numberOne);
// } else if (numberOne < numberTwo) {
//     console.log(numberTwo);
// } else {
//     console.log('Числа рівні');
// }

// // У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// // Користувач вводить номер квартири просто в змінні або через prompt('') .
// // Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
//
//
// let numberOfFlat = prompt('Введіть номер квартири');
//
// if(numberOfFlat>=1&&numberOfFlat<=20){
//     console.log('Квартира знаходиться в першому під`їзді');
// }else if(numberOfFlat>=21&&numberOfFlat<=48){
//     console.log('Квартира знаходиться в другому під`їзді');
// }else if(numberOfFlat>=49&&numberOfFlat<=90) {
//     console.log('Квартира знаходиться в третьому під`їзді');
// }else {
//     console.log('Квартира відсутня в даному будинку')
// }

// // - Ми маємо змінну number в яку користувач задає числове значення,
// // якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
//
// let number = prompt('Введіть число');
//
// if (number === '10') {
//     console.log('ВІРНО');
//
// } else {
//     console.log('НЕВІРНО')
// }

// // - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
// //     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// // якщо в змінну записали щось інше, спрацьовує else
//
// let x = {};
//
// if (typeof x === "number") {
//     console.log(1);
//
// } else if (typeof x === "string") {
//     console.log(2);
//
// } else if (typeof x === "object") {
//     console.log(3);
// } else {
//     console.log("oops");
// }

// // - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
// //     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
// //     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
//
// let temperature = prompt('Введіть сьогоднішню температуру');
//
// if (temperature >= 10 && temperature <= 22) {
//     alert('Ми йдемо вчитись');
//
// } else {
//     alert('Сидимо вдома і вчимось онлайн');
// }

// // - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
// //     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .
//
// let number = prompt('ВІКТОРИНА. Введіть число від 1 до 5');
//
// switch (number) {
//     case '1':
//         console.log('ВІТАЮ!!! ВИ виграли авто');
//         break;
//     case '2':
//         console.log('ВІТАЮ!!! ВИ виграли мотоцикл');
//         break;
//     case '3':
//         console.log('ВІТАЮ!!! ВИ виграли телефон');
//         break;
//     case '4':
//         console.log('ВІТАЮ!!! ВИ виграли навушники');
//         break;
//     case '5':
//         console.log('ВІТАЮ!!! ВИ виграли павербенк');
//         break;
//     default:
//         console.log('Число не вірне!!');
// }